//=================================================================================================================
//※ 변수 지정
//=================================================================================================================

var quantity = [
	5,//빙벽조각 평균 수량
	110,//마그토늄 평균 수량
	40//데이터칩 평균 수량
]

var base = [
	78,//타락한 신전 기본수익 (단위 : 만골드)
	80,//그란디네 발전소 기본수익 (단위 : 만골드)
	102//샐러맨더의 화로 기본수익 (단위 : 만골드)
]

var name_material = [
	"빙벽조각",
	"마그토늄",
	"데이터칩"
]

var name_dungeon = [
	"타락한 신전",
	"그란디네 발전소",
	"샐러맨더의 화로"
]